## Session 1

In [77]:
radius = 2
pi = 3.14
area = pi * radius**2

print(area)

12.56

In [78]:
name = "CHVLR"
pronunciation = "'shuh' + 'VAL' + 'ee' + 'ay'"
sentence = f"My name is {name} and it is pronounced {pronunciation}"
print(sentence)

My name is CHVLR and it is pronounced 'shuh' + 'VAL' + 'ee' + 'ay'

In [79]:
slice_this_phrase = 'dog cat racoon'

dog = slice_this_phrase[:3]
cat = slice_this_phrase[4:7]
racoon = slice_this_phrase[-6:]

print(dog)
print(cat)
print(racoon)

dog
cat
racoon

In [80]:
list = [1, 2, 3]
list.append(4)
list.extend([4, 5, 6])

print(list)

[1, 2, 3, 4, 4, 5, 6]

## Session 2

In [81]:
restaurants = {"McDonalds": "Burger",
               "Starbucks": "Coffee",
               "KFC": "Chicken",
               "Zizzis": ["Pizza, Pasta"],
               "The Pub": {"Monday": "Soup",
                           "Tuesday": "Sausage",
                           "Others": "Booze"
                           }
                        }

print(restaurants["McDonalds"])
print(restaurants["The Pub"]["Monday"])

restaurants["Geminis"] = "Food poisoning"

print(restaurants.keys())
print(restaurants.values())
print(restaurants.items())

print("McDonalds" in restaurants)

Burger
Soup
dict_keys(['McDonalds', 'Starbucks', 'KFC', 'Zizzis', 'The Pub', 'Geminis'])
dict_values(['Burger', 'Coffee', 'Chicken', ['Pizza, Pasta'], {'Monday': 'Soup', 'Tuesday': 'Sausage', 'Others': 'Booze'}, 'Food poisoning'])
dict_items([('McDonalds', 'Burger'), ('Starbucks', 'Coffee'), ('KFC', 'Chicken'), ('Zizzis', ['Pizza, Pasta']), ('The Pub', {'Monday': 'Soup', 'Tuesday': 'Sausage', 'Others': 'Booze'}), ('Geminis', 'Food poisoning')])
True

In [82]:
import pandas as pd

filepath = 'https://raw.githubusercontent.com/data-to-insight/csc-validator-be-903/main/tests/fake_data/header.csv'

fake_header_data = pd.read_csv(filepath)

In [83]:
print(fake_header_data.head(10))
print(fake_header_data.tail())

    CHILD  SEX         DOB ETHNIC            UPN  MOTHER MC_DOB
0  566910    2  27/03/2008   WROM  D051910639385     NaN    NaN
1  384923    2  09/09/2011   REFU  L034811502612     NaN    NaN
2  709901    1  14/02/2013   ABAN  Y021751958510     NaN    NaN
3  550084    2  04/05/2008   AOTH  R095578985099     NaN    NaN
4  710229    2  15/04/2002   REFU  Z095096287583     NaN    NaN
5  733831    1  06/07/2013   WROM  Z005227500041     NaN    NaN
6   69112    2  11/09/2010   ABAN  X089575916879     NaN    NaN
7  853884    2  09/10/2004   WBRI  U096513817313     NaN    NaN
8  634852    2  19/10/2006   WIRI  X019131453866     NaN    NaN
9  512087    1  01/10/2003   MOTH  J091207487052     NaN    NaN
       CHILD  SEX         DOB ETHNIC            UPN  MOTHER MC_DOB
2670  152113    1  06/06/2003   WBRI  K096794376750     NaN    NaN
2671  481370    2  12/02/2008   BAFR  C014150452081     NaN    NaN
2672  791577    1  28/05/2011   WBRI  Q009369089812     NaN    NaN
2673  238470    1  21/11/2013   AIND  P095222532769     NaN    NaN
2674  437361    1  15/12/2012   WROM  G018001328504     NaN    NaN

In [84]:
workers = pd.DataFrame(
    [
        {'Name': 'David Richards',
      'Salary': 23600,
      'Job Title': 'Burger Flipper'},
      {'Name': 'Milo Relo',
      'Salary': 38450,
      'Job Title': 'Robot Cleaner'},
      {'Name': 'Jenny Paloe',
      'Salary': 19700,
      'Job Title': 'Funny Guy'},
      {'Name': 'Margie Felhouse',
      'Salary': 31500,
      'Job Title': 'Frozen Food Procurer'},
      {'Name': 'Brian Workansen',
      'Salary': 25000,
      'Job Title': 'Bingo Organiser'},
    ]
)
print(workers)

print(workers[['Salary','Job Title']])

              Name  Salary             Job Title
0   David Richards   23600        Burger Flipper
1        Milo Relo   38450         Robot Cleaner
2      Jenny Paloe   19700             Funny Guy
3  Margie Felhouse   31500  Frozen Food Procurer
4  Brian Workansen   25000       Bingo Organiser
   Salary             Job Title
0   23600        Burger Flipper
1   38450         Robot Cleaner
2   19700             Funny Guy
3   31500  Frozen Food Procurer
4   25000       Bingo Organiser

In [85]:
workers['Salary'] = workers['Salary'].astype('int')
print(workers['Salary'].dtypes)

mean_salary = workers['Salary'].mean()
sum_salary = workers['Salary'].sum()
max_salary = workers['Salary'].max()
min_salary = workers['Salary'].min()

print(f'Mean = {mean_salary}, Sum = {sum_salary}, Max = {max_salary}, Min = {min_salary}.')

int64
Mean = 27650.0, Sum = 138250, Max = 38450, Min = 19700.

## Session 3

In [86]:
import pandas as pd
import numpy as np

filename = '/workspaces/python-d2i-learning/ChildIdentifiers.csv'

data = pd.read_csv(filename)

print(data.head())


data['Date of Birth'] = pd.to_datetime(data['PersonBirthDate'], format='%Y-%m-%d', errors='coerce')

data['Age of Person'] = pd.to_datetime('today').normalize() - data['Date of Birth']

data['Age of Person'] = (data['Age of Person'] / pd.Timedelta('365 days')).astype('int')
print(data[['PersonBirthDate', 'Date of Birth','Age of Person']])

   Unnamed: 0        LAchildID            UPN  FormerUPN  UPNunknown  \
0           0  RND000215205141  A850728973744        NaN         NaN
1           1  RND000824303014  A141396438491        NaN         NaN
2           2  RND000750143123  A929946861554        NaN         NaN
3           3  RND000909164501  A612330267292        NaN         NaN
4           4  RND000382171815  A604459366806        NaN         NaN

  PersonBirthDate ExpectedPersonBirthDate  GenderCurrent PersonDeathDate
0      2019-12-06                     NaN              1             NaN
1      2011-04-27                     NaN              9             NaN
2      2017-06-06              2019-12-06              1             NaN
3      2014-10-03                     NaN              0             NaN
4      2019-09-25                     NaN              2             NaN
    PersonBirthDate Date of Birth  Age of Person
0        2019-12-06    2019-12-06              4
1        2011-04-27    2011-04-27             12
2        2017-06-06    2017-06-06              6
3        2014-10-03    2014-10-03              9
4        2019-09-25    2019-09-25              4
..              ...           ...            ...
327      2010-07-07    2010-07-07             13
328      2018-08-14    2018-08-14              5
329      2021-12-09    2021-12-09              2
330      2013-07-23    2013-07-23             10
331      2021-10-25    2021-10-25              2

[332 rows x 3 columns]

In [87]:
gender_map = {1: 'Male',
              2:'Female',
              4:'Unknown',
              9:'Unknown'
            }

data['GenderCategory'] = data['GenderCurrent'].map(gender_map)


over_18_condition = data['Age of Person'] > 18
over_18_male_condition = (data['Age of Person'] > 18) & (data['GenderCategory'] == 'Male')

sliced_df = data[over_18_male_condition]

## Session 4

In [88]:
df = pd.DataFrame({'ChildId':['id1', 'id2', 'id3', 'id4', 'id5'],
                   'Age first contact':[6,12,11,1,19],
                   'Gender':['M','m', 'F', '', 'F' ],
                   'Birthday':['01/01/2002', '02/02/2003', pd.NA, '03/03/2023', '06/01/2012'],
                   'CP Plan?':['Y', 'n', 'N', 'No', 'yES'],})

print(df.info()) #Has birthday as 'object' (text) so want this as a date really.

print(df.head(5)) #Note blank space in gender (not NA) so needs fixing. CP plan answers not standardisd. Gender has mixed lower/upper

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ChildId            5 non-null      object
 1   Age first contact  5 non-null      int64
 2   Gender             5 non-null      object
 3   Birthday           4 non-null      object
 4   CP Plan?           5 non-null      object
dtypes: int64(1), object(4)
memory usage: 328.0+ bytes
None
  ChildId  Age first contact Gender    Birthday CP Plan?
0     id1                  6      M  01/01/2002        Y
1     id2                 12      m  02/02/2003        n
2     id3                 11      F        <NA>        N
3     id4                  1         03/03/2023       No
4     id5                 19      F  06/01/2012      yES

In [89]:
df['Birthday'] = pd.to_datetime(df['Birthday'], format='%d/%m/%Y', errors='coerce')

print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   ChildId            5 non-null      object
 1   Age first contact  5 non-null      int64
 2   Gender             5 non-null      object
 3   Birthday           4 non-null      datetime64[ns]
 4   CP Plan?           5 non-null      object
dtypes: datetime64[ns](1), int64(1), object(3)
memory usage: 328.0+ bytes
None

In [90]:
df['Age March 31'] = pd.to_datetime('31/03/2024', dayfirst=True) - df['Birthday']

print(df) # Age on date is in days, a timedelta type

  ChildId  Age first contact Gender   Birthday CP Plan? Age March 31
0     id1                  6      M 2002-01-01        Y    8125 days
1     id2                 12      m 2003-02-02        n    7728 days
2     id3                 11      F        NaT        N          NaT
3     id4                  1        2023-03-03       No     394 days
4     id5                 19      F 2012-01-06      yES    4468 days

In [91]:
df['Age March 31'] = df['Age March 31'] / pd.Timedelta('365 days')

df['Age March 31'] = df['Age March 31'].round().astype('int',errors='ignore')

print(df)

  ChildId  Age first contact Gender   Birthday CP Plan?  Age March 31
0     id1                  6      M 2002-01-01        Y          22.0
1     id2                 12      m 2003-02-02        n          21.0
2     id3                 11      F        NaT        N           NaN
3     id4                  1        2023-03-03       No           1.0
4     id5                 19      F 2012-01-06      yES          12.0

In [92]:
df['Current Age'] = pd.to_datetime('today').normalize() - df['Birthday']
df['Current Age'] = df['Current Age'] / pd.Timedelta('365 days')
df['Current Age'] = df['Current Age'].round().astype('int', errors='ignore')

print(df)

  ChildId  Age first contact Gender   Birthday CP Plan?  Age March 31  \
0     id1                  6      M 2002-01-01        Y          22.0
1     id2                 12      m 2003-02-02        n          21.0
2     id3                 11      F        NaT        N           NaN
3     id4                  1        2023-03-03       No           1.0
4     id5                 19      F 2012-01-06      yES          12.0

   Current Age
0         22.0
1         21.0
2          NaN
3          1.0
4         12.0

In [93]:
gender_dict = {'M':'m',
               'm':'m',
               'F':'f',
               'f':'f'}

df['Gender'] = df['Gender'].map(gender_dict)

# alternative is df['Gender] = df['Gender'].str.lower()

df['Gender'] = df['Gender'].fillna(pd.NA)

print(df)

  ChildId  Age first contact Gender   Birthday CP Plan?  Age March 31  \
0     id1                  6      m 2002-01-01        Y          22.0
1     id2                 12      m 2003-02-02        n          21.0
2     id3                 11      f        NaT        N           NaN
3     id4                  1   <NA> 2023-03-03       No           1.0
4     id5                 19      f 2012-01-06      yES          12.0

   Current Age
0         22.0
1         21.0
2          NaN
3          1.0
4         12.0

In [94]:
cp_cleaner = lambda row: 'y' if 'y' in row else 'n' if 'n' in row else pd.NA

df['CP Plan?'] = df['CP Plan?'].str.lower().apply(cp_cleaner)

df

,ChildId,Age first contact,Gender,Birthday,CP Plan?,Age March 31,Current Age
0,id1,6,m,2002-01-01,y,22.0,22.0
1,id2,12,m,2003-02-02,n,21.0,21.0
2,id3,11,f,NaT,n,NaN,NaN
3,id4,1,<NA>,2023-03-03,n,1.0,1.0
4,id5,19,f,2012-01-06,y,12.0,12.0

In [95]:
new_child = {
    'ChildId':['id6'],
    'Current Age': [10],
    'Age first contact':[9],
    'Gender':['m'],
    'Birthday':[pd.to_datetime('28/02/2014', dayfirst=True)],
    'Age March 31':[10],
    'NHS Number':['78132']
}

new_child = pd.DataFrame(new_child)

df = pd.concat([df,new_child], ignore_index=True)

df.drop_duplicates(subset='ChildId', keep='last', inplace=True)

df

,ChildId,Age first contact,Gender,Birthday,CP Plan?,Age March 31,Current Age,NHS Number
0,id1,6,m,2002-01-01,y,22.0,22.0,NaN
1,id2,12,m,2003-02-02,n,21.0,21.0,NaN
2,id3,11,f,NaT,n,NaN,NaN,NaN
3,id4,1,<NA>,2023-03-03,n,1.0,1.0,NaN
4,id5,19,f,2012-01-06,y,12.0,12.0,NaN
5,id6,9,m,2014-02-28,NaN,10.0,10.0,78132

In [100]:
nhs_numbers = pd.DataFrame([
                            {'ChildId':'id1',
                            'NHS Number': '303',},
                            {'ChildId':'id2',
                            'NHS Number': '3u5029',},
                            {'ChildId':'id3',
                            'NHS Number': 'gqw3',},
                            {'ChildId':'id4',
                            'NHS Number': 'avsgvb',},
                            {'ChildId':'id5',
                            'NHS Number': 'varwvw',},
                            ])

nhs_numbers

df = pd.merge(df, nhs_numbers, how='inner', left_on='ChildId', right_on='ChildId',
              suffixes=['_original','_nhs_num'])

df

,ChildId,Age first contact,Gender,Birthday,CP Plan?,Age March 31,Current Age,NHS Number_x,NHS Number_y,NHS Number_original,NHS Number_nhs_num
0,id1,6,m,2002-01-01,y,22.0,22.0,NaN,303,303,303
1,id2,12,m,2003-02-02,n,21.0,21.0,NaN,3u5029,3u5029,3u5029
2,id3,11,f,NaT,n,NaN,NaN,NaN,gqw3,gqw3,gqw3
3,id4,1,<NA>,2023-03-03,n,1.0,1.0,NaN,avsgvb,avsgvb,avsgvb
4,id5,19,f,2012-01-06,y,12.0,12.0,NaN,varwvw,varwvw,varwvw

In [101]:
df['NHS Number_original'] = df['NHS Number_original'].fillna(df['NHS Number_nhs_num'])

df

,ChildId,Age first contact,Gender,Birthday,CP Plan?,Age March 31,Current Age,NHS Number_x,NHS Number_y,NHS Number_original,NHS Number_nhs_num
0,id1,6,m,2002-01-01,y,22.0,22.0,NaN,303,303,303
1,id2,12,m,2003-02-02,n,21.0,21.0,NaN,3u5029,3u5029,3u5029
2,id3,11,f,NaT,n,NaN,NaN,NaN,gqw3,gqw3,gqw3
3,id4,1,<NA>,2023-03-03,n,1.0,1.0,NaN,avsgvb,avsgvb,avsgvb
4,id5,19,f,2012-01-06,y,12.0,12.0,NaN,varwvw,varwvw,varwvw

In [102]:
df.drop('NHS Number_nhs_num', inplace=True, axis=1)

df

,ChildId,Age first contact,Gender,Birthday,CP Plan?,Age March 31,Current Age,NHS Number_x,NHS Number_y,NHS Number_original
0,id1,6,m,2002-01-01,y,22.0,22.0,NaN,303,303
1,id2,12,m,2003-02-02,n,21.0,21.0,NaN,3u5029,3u5029
2,id3,11,f,NaT,n,NaN,NaN,NaN,gqw3,gqw3
3,id4,1,<NA>,2023-03-03,n,1.0,1.0,NaN,avsgvb,avsgvb
4,id5,19,f,2012-01-06,y,12.0,12.0,NaN,varwvw,varwvw

In [103]:
df.rename({'NHS Number_original': 'NHS Number'}, axis=1, inplace=True)

df

,ChildId,Age first contact,Gender,Birthday,CP Plan?,Age March 31,Current Age,NHS Number_x,NHS Number_y,NHS Number
0,id1,6,m,2002-01-01,y,22.0,22.0,NaN,303,303
1,id2,12,m,2003-02-02,n,21.0,21.0,NaN,3u5029,3u5029
2,id3,11,f,NaT,n,NaN,NaN,NaN,gqw3,gqw3
3,id4,1,<NA>,2023-03-03,n,1.0,1.0,NaN,avsgvb,avsgvb
4,id5,19,f,2012-01-06,y,12.0,12.0,NaN,varwvw,varwvw